On February 13, 2025, a meeting was held involving André Neiva, Rita Joana, Daniel Furtado, and Francisco Falcão. The meeting began with André and Rita discussing the need to stabilize their presentation setup, leading to a brief introduction of Daniel, who is an engineer with a background in web development. André explained the purpose of the meeting, which was to present their models and future development plans, as well as to review a report from a recent meeting they had two days prior.

The initial focus was on how their platform records training sessions while removing elements of engagement and active participation. André emphasized the importance of understanding what topics were discussed and how effective the training was. He mentioned that after each meeting, participants would receive tailored reports highlighting their engagement levels, which could help identify areas that require more attention in future sessions. This would allow trainers to see which parts of the presentation may have caused loss of attention and suggest improvements accordingly.

André shared an example of a report from a meeting held on February 11, detailing its objectives and how well they were achieved. The report includes metrics on the effectiveness of the meeting, topics discussed, and the duration of each segment. They discussed how the tool could be beneficial not only in educational settings but also in corporate and sports training contexts, showcasing its versatility.

As the meeting progressed, Francisco joined and caught up on the discussion about the report. The team talked about the importance of capturing participant engagement and using data to enhance the quality of future sessions. They explored how the platform could provide individual feedback based on performance and engagement, which could help both the trainers and participants.

Rita shared her experiences with different training programs and highlighted the challenges she faced, particularly with ensuring the effectiveness of training when participants were not fully engaged. She mentioned the importance of having accurate feedback to improve training sessions, as often the feedback obtained through traditional means can be misleading.

As the conversation continued, they began discussing the legal implications of recording sessions and how to obtain participants’ consent. André suggested that they need to establish clear guidelines for how personal data would be handled, emphasizing that participants should be informed about the purpose of the recording and how the data would be used.

The dialogue shifted to how the tool could help form a comprehensive database for participants, allowing them to access their past training sessions and summaries easily. Francisco elaborated on how participants could benefit from having their training documented, which could aid them in future job applications by showing proof of their skills and knowledge.

The meeting concluded with discussions about the next steps, including sending an email to the University of Minho regarding collaboration opportunities and ensuring that they had the necessary permissions in place for recording sessions. Rita expressed her desire to streamline the process and emphasized the importance of having robust data to sell the training effectively. The team agreed to follow up on these points and keep each other updated on progress, aiming to enhance the training experience through their innovative platform.

