The meeting, which took place on February 13, 2025, was initiated by André Neiva, who set the stage for a presentation involving several participants, including Daniel Furtado and Rita Joana. The discussion began with an introduction of Daniel, who is an engineer and a student in web development, highlighting the connection between the team members, particularly noting that they all hail from the same area, Barcelos. André explained that the purpose of the meeting was to discuss the development and future of their training and engagement models, emphasizing the importance of capturing data from their training sessions to assess effectiveness.

André elaborated on the process of recording training sessions, noting how they would extract engagement and participation metrics to provide feedback for improvement. He described the automated systems they are implementing to streamline the reporting process, with the goal of making reports available shortly after meetings. Each participant would receive tailored reports that reflect their performance, engagement levels, and suggestions for improvement. For instance, if a particular topic lost the attention of attendees, future sessions could address that gap.

Rita expressed her interest in the system’s ability to provide insights into student engagement, noting the benefits of receiving personalized feedback, which could help improve their teaching methods. The conversation delved into specific reports from a prior meeting held two days earlier, where they reviewed objectives and outcomes, discussing what worked, what didn’t, and the potential for enhancing their approach in future training sessions.

As the meeting progressed, Francisco Falcão joined, adding to the discussion about the applicability of their models in various contexts, including corporate training and potentially even sports coaching. The team recognized the value of gathering data not just for immediate feedback but also for long-term improvements in how they deliver training.

The discussion shifted to the challenges and nuances of implementing these systems, particularly regarding obtaining permissions from participants to record sessions and collect data. They acknowledged the need for clear communication about how recordings would be used and the importance of ensuring participants were aware of their engagement being monitored.

Rita shared her experiences with the IFMT (Instituto Federal do Mato Grosso) and the rigorous regulations surrounding training, emphasizing that the proposed system could significantly enhance the quality of training evaluations and participant satisfaction. She highlighted the necessity of adapting training methods to meet participant expectations and the challenges of maintaining engagement during mandatory training sessions.

The conversation also touched on the potential future developments of the system, including a more user-friendly interface and live data processing capabilities that would enhance the training experience without the need for extensive post-session analysis.

Towards the end of the meeting, the participants discussed next steps, including sending a follow-up email to the University of Minho to explore potential collaborations. They aimed to finalize the details regarding permissions and the use of their reporting tools in future training sessions. The meeting concluded with a light-hearted exchange among the participants, underscoring their camaraderie and shared commitment to enhancing training effectiveness through data-driven insights.